modm-ext/data.modm.io/docs/svd/header_stm32l151xca.svd
        <register>
          <name>JSQR</name>
          <description>ADC injected sequence register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>JSQ1</name>
              <description>ADC group injected sequencer rank 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ2</name>
              <description>ADC group injected sequencer rank 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ3</name>
              <description>ADC group injected sequencer rank 3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ4</name>
              <description>ADC group injected sequencer rank 4</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JL</name>
              <description>ADC group injected sequencer scan length</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>ADC group injected sequencer disable (equivalent to sequencer of 1 rank: ADC conversion on only 1 channel)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_2RANKS</name>
                  <description>ADC group injected sequencer enable with 2 ranks in the sequence</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_3RANKS</name>
                  <description>ADC group injected sequencer enable with 3 ranks in the sequence</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_4RANKS</name>
                  <description>ADC group injected sequencer enable with 4 ranks in the sequence</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR1</name>
          <description>ADC injected data register 1</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC group injected sequencer rank 1 conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR2</name>
          <description>ADC injected data register 2</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC group injected sequencer rank 2 conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR3</name>
          <description>ADC injected data register 3</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC group injected sequencer rank 3 conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR4</name>
          <description>ADC injected data register 4</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC group injected sequencer rank 4 conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>ADC regular data register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>ADC group regular conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR0</name>
          <description>ADC sample time register 0</description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SMP30</name>
              <description>ADC channel 30 sampling time selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP31</name>
              <description>ADC channel 31 sampling time selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <description>ADC common status register</description>
          <addressOffset>0x300</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AWD1</name>
              <description>ADC multimode master analog watchdog 1 flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOCS1</name>
              <description>ADC multimode master group regular end of unitary conversion or end of sequence conversions flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JEOS1</name>
              <description>ADC multimode master group injected end of sequence conversions flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JSTRT1</name>
              <description>ADC multimode master group injected conversion start flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STRT1</name>
              <description>ADC multimode master group regular conversion start flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR1</name>
              <description>ADC multimode master group regular overrun flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADONS1</name>
              <description>ADC multimode master ready flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>ADC common control register</description>
          <addressOffset>0x304</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADCPRE</name>
              <description>ADC clock source asynchronous prescaler</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>ADC asynchronous clock without prescaler</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>ADC asynchronous clock with prescaler division by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>ADC asynchronous clock with prescaler division by 4</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSVREFE</name>
              <description>ADC internal path to VrefInt and temperature sensor enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>ADC measurement paths all disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFINT</name>
                  <description>ADC measurement path to internal channel VrefInt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
